---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalDefinitionCreationOptions
source: html/7edbc920-17a3-bd5b-0ee6-4a17a43a1a6d.htm
---
# ExternalDefinitionCreationOptions Properties

The description of the parameter definition to be created. The description will be used as tooltip in the
 Revit UI including in the properties palette.
 The default is an empty string.